; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared6 - mode
	spectrograph4 - mode
	infrared3 - mode
	spectrograph0 - mode
	thermograph2 - mode
	image1 - mode
	image5 - mode
	Star1 - direction
	Star3 - direction
	Star4 - direction
	Star5 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	Star11 - direction
	Star12 - direction
	GroundStation6 - direction
	GroundStation10 - direction
	Star9 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Star13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph4)
	(supports instrument0 infrared6)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star9)
	(supports instrument1 infrared3)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star9)
	(calibration_target instrument1 Star13)
	(calibration_target instrument1 GroundStation10)
	(calibration_target instrument1 GroundStation6)
	(supports instrument2 spectrograph0)
	(supports instrument2 image5)
	(supports instrument2 image1)
	(calibration_target instrument2 Star13)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
)
(:goal (and
	(have_image Phenomenon14 infrared6)
	(have_image Phenomenon14 spectrograph0)
	(have_image Star15 image1)
	(have_image Phenomenon16 spectrograph0)
	(have_image Phenomenon17 infrared6)
))

)

; plan
1. (turn_to satellite0 phenomenon14 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon14)
   goals met: 0 of 5
2. (turn_to satellite0 star9 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star9)
   goals met: 0 of 5
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
4. (calibrate satellite0 instrument0 star9)
   added: (calibrated instrument0)
   goals met: 0 of 5
5. (turn_to satellite0 phenomenon14 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon14)
   goals met: 0 of 5
6. (take_image satellite0 phenomenon14 instrument0 infrared6)
   added: (have_image phenomenon14 infrared6)
   goals met: 1 of 5
7. (take_image satellite0 phenomenon14 instrument0 spectrograph0)
   added: (have_image phenomenon14 spectrograph0)
   goals met: 2 of 5
8. (turn_to satellite0 groundstation0 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 groundstation0)
   goals met: 2 of 5
9. (turn_to satellite0 phenomenon16 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon16)
   goals met: 2 of 5
10. (take_image satellite0 phenomenon16 instrument0 spectrograph0)
   added: (have_image phenomenon16 spectrograph0)
   goals met: 3 of 5
11. (turn_to satellite0 groundstation0 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 groundstation0)
   goals met: 3 of 5
12. (turn_to satellite0 phenomenon17 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon17)
   goals met: 3 of 5
13. (take_image satellite0 phenomenon17 instrument0 infrared6)
   added: (have_image phenomenon17 infrared6)
   goals met: 4 of 5
14. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 4 of 5
15. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 4 of 5
16. (turn_to satellite0 star15 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 star15)
   goals met: 4 of 5
17. (turn_to satellite0 star9 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star9)
   goals met: 4 of 5
18. (calibrate satellite0 instrument2 star9)
   added: (calibrated instrument2)
   goals met: 4 of 5
19. (turn_to satellite0 star15 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star15)
   goals met: 4 of 5
20. (take_image satellite0 star15 instrument2 image1)
   added: (have_image star15 image1)
   goals met: 5 of 5
